Revit 2024 API
StairsEditScope.Start Method
Overload List
Name | Description
Start(ElementId)
 Starts an stairs edit mode for an existing Stairs element
Start(ElementId, ElementId)
 Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs.
See Also
StairsEditScope Class
StairsEditScope Members
Autodesk.Revit.DB Namespace